# 화살의 개수 n
# 어피치가 맞힌 과녁 점수의 개수를 10점부터 0점까지 순서대로 담은 정수 배열 info
# 라이언이 점수를 얻으려면 무조건 어피치보다 많은 갯수를 과녘에 맞춰야 함
# 이라이언이 가장 큰 점수 차이로 우승하기 위해 n발의 화살을 어떤 과녁 점수에 맞혀야 하는지 return
# 라이언이 우승할 수 없는 경우(무조건 지거나 비기는 경우)는 [-1]을 return


def solution(n, info):
    answer = []


    return(answer)


solution(5, [2,1,1,1,0,0,0,0,0,0,0])    # [0,2,2,0,1,0,0,0,0,0,0]
solution(1, [1,0,0,0,0,0,0,0,0,0,0])    # [-1]
solution(9, [0,0,1,2,0,1,1,1,1,1,1])    # [1,1,2,0,1,2,2,0,0,0,0]
solution(10, [0,0,0,0,0,0,0,0,3,4,3])   # [1,1,1,1,1,1,1,1,0,0,2]